XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G32x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31G32x_Series</name>
  <description>ABOV Semiconductor A31G32x Device Support, Drivers and Examples</description>
  <url>http://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.00.0" date="2020-01-17">
            - First Release for A31G323, A31G324
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31G32x</keyword>
	<keyword>A31G323</keyword>
    <keyword>A31G324</keyword>
    <keyword>General Purpose</keyword>
  </keywords>
  <devices>
    <family Dfamily="A31G32x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV A31G32x Series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals
          </description>
      <!-- Subfamily : A31G32x *********************************************************-->
      <subFamily DsubFamily="A31G32x">
        <processor Dclock="48000000" />
        <compile header="A31G32x\Core\include\A31G32x.h" />
        <debug svd="A31G32x\SVD\A31G32x.svd" />
        <feature type="VCC" n="1.8" m="5.5" />
        <feature type="Temp" n="-40" m="105" />
        <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1" />
        <!-- Device : A31G323-->
        <device Dname="A31G323">
          <description>Package type 48LQFP/64LQFP</description>
          <algorithm name="A31G32x\Flashloader\A31G323_64.FLM" start="0x00000000" size="0x10000" default="1" /> 
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        </device>
		<!-- Device : A31G324-->
        <device Dname="A31G324">
          <description>Package type 48LQFP/64LQFP</description>
          <algorithm name="A31G32x\Flashloader\A31G324_128.FLM" start="0x00000000" size="0x20000" default="1" />  
          <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <!-- condition : A31G323/324 ********************************************************-->
    <condition id="A31G32x CMSIS">
      <description>A31G323/324  device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G323" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G324" />
    </condition>
  </conditions>
  <components>
    <!-- component : A31G323/324 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.00" condition="A31G32x CMSIS">
      <description>System Startup for ABOV A31G323/324 devices</description>
      <files>
        <file category="include" name="A31G32x\Core\include/" />
        <file category="include" name="A31G32x\Drivers\include/" />
        <file category="header" version="1.00" name="A31G32x\Core\include\A31G32x.h" attr="config" />
        <file category="header" version="1.00" name="A31G32x\Core\include\system_A31G32x.h" attr="config" />
        <file category="source" version="1.00" name="A31G32x\Core\source\ARM\startup_A31G32x.s" attr="config" />
        <file category="source" version="1.00" name="A31G32x\Core\source\system_A31G32x.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x debug framework</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_aa_types.h" />
		<file category="header" name="A31G32x\Drivers\include\A31G32x_hal_libcfg.h" />
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_debug_frmwrk.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="adc" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x adc control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_adc.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="cmp" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x comparator control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_comp.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_comp.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="crc" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x crc control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_crc.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dac" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x dac control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_dac.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_dac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dmac" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x dmac control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_dmac.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_dmac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="i2c" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x i2c control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_i2c.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_i2c.c" />
      </files>
    </component>
