XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G32x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="spi" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x spi control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_spi.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ebi" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x ebi control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_ebi.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_ebi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pcu" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x pcu control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_pcu.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pwr" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x pwr control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_pwr.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="scu" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x scu control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_scu.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer1n" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x 16-bit timer1n control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer1n.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_timer1n.c" />
		<file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer_common.h" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer2n" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x 32-bit timer2n control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer2n.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_timer2n.c" />
		<file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer_common.h" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer30" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x 6-ch PWM timer30 control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer30.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_timer30.c" />
		<file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer_common.h" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Drivers" Csub="timer40" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x 16-bit 3-Channel XOR timer40 control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer40.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_timer40.c" />
		<file category="header" name="A31G32x\Drivers\include\A31G32x_hal_timer_common.h" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="usart" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x usart control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_usartn.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_usartn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wdt" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x watch dog timer control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_wdt.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wt" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x watch timer control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_wt.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_wt.c" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Drivers" Csub="rtc" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x rtc control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_rtc.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_rtc.c" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Drivers" Csub="tempsensor" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x tempsensor control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_tempsensor.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_tempsensor.c" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Drivers" Csub="usb" Cversion="1.00" condition="A31G32x CMSIS">
      <description>A31G32x usb control</description>
      <files>
        <file category="header" name="A31G32x\Drivers\include\A31G32x_hal_usb.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_usb.c" />
		<file category="header" name="A31G32x\Drivers\include\A31G32x_hal_usb_core.h" />
        <file category="source" name="A31G32x\Drivers\source\A31G32x_hal_usb_core.c" />
      </files>
    </component>
