XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G32x_Series.pdsc
  </components>
  <boards>
    <!-- board : A31G324 ************************************************************-->
    <board vendor="ABOV" name="StarterKit-A31G324RLN" revision="V1.0">
      <description>StarterKit-A31G324RLN</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G324" />
	  <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G323" />
      <feature type="XTAL" n="8000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs: D101~106" />
	  <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
  </boards>
  <examples>
    <!-- example : A31G323/324 **********************************************************-->
    <example name="ABOV ADC Burst" doc="Abstract.txt" folder="A31G32x\Examples\ADC\ADC_Burst">
      <description>ADC ADC_Burst example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Burst.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV ADC DMA" doc="Abstract.txt" folder="A31G32x\Examples\ADC\ADC_DMA">
      <description>ADC DMA example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_DMA.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\ADC\ADC_Interrupt">
      <description>ADC Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Multiple" doc="Abstract.txt" folder="A31G32x\Examples\ADC\ADC_Multiple">
      <description>ADPCM Multiple (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Multiple.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Polling" doc="Abstract.txt" folder="A31G32x\Examples\ADC\ADC_Polling">
      <description>ADC Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV ADC Single" doc="Abstract.txt" folder="A31G32x\Examples\ADC\ADC_Single">
      <description>ADC Single example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Single.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV COMP Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\COMP\COMP_interrupt">
      <description>Comparator Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\COMP_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV COMP Polling" doc="Abstract.txt" folder="A31G32x\Examples\COMP\COMP_polling">
      <description>Comparator Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\COMP_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV COMP Wakeup" doc="Abstract.txt" folder="A31G32x\Examples\COMP\COMP_wakeup">
      <description>Comparator Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\COMP_wakeup.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CCITT" doc="Abstract.txt" folder="A31G32x\Examples\CRC\CRC_CCITT">
      <description>CRC CCITT example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC_CCITT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CCITT DMA RAM" doc="Abstract.txt" folder="A31G32x\Examples\CRC\CRC_CCITT_DMA_RAM">
      <description>CRC CCITT DMA RAM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC_CCITT_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Checksum" doc="Abstract.txt" folder="A31G32x\Examples\CRC\CRC_Checksum">
      <description>CRC Checksum example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC_Checksum.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Checksum DMA RAM" doc="Abstract.txt" folder="A31G32x\Examples\CRC\CRC_Checksum_DMA_RAM">
      <description>CRC Checksum DMA RAM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC_Checksum_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CRC16" doc="Abstract.txt" folder="A31G32x\Examples\CRC\CRC_CRC16">
      <description>CRC CRC16 example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC_CRC16.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CRC16 DMA RAM" doc="Abstract.txt" folder="A31G32x\Examples\CRC\CRC_CRC16_DMA_RAM">
      <description>CRC CRC16 DMA RAM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC_CRC16_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DAC Polling" doc="Abstract.txt" folder="A31G32x\Examples\DAC\DAC_polling">
      <description>DAC Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\DAC_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV Debug Polling Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\Debug\Debug_Polling_Interrupt">
      <description>Debug Polling Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Debug_Polling_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV EBI LCD Control" doc="Abstract.txt" folder="A31G32x\Examples\EBI\EBI_LCD_Control">
      <description>EBI LCD Control example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\EBI_LCD_Control.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC CRC CCITT Write" doc="Abstract.txt" folder="A31G32x\Examples\FMC\FMC_CRC_CCITT">
      <description>FMC CRC CCITT example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FMC_CRC_CCITT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV FMC Erase Write" doc="Abstract.txt" folder="A31G32x\Examples\FMC\FMC_WriteErase">
      <description>FMC Erase Write example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write (Self PGM)" doc="Abstract.txt" folder="A31G32x\Examples\FMC\FMC_WriteErase_selfPGM">
      <description>FMC Erase Write (Self PGM) example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FMC_WriteErase_selfPGM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write (in RAM)" doc="Abstract.txt" folder="A31G32x\Examples\FMC\FMC_WriteErase_lock_in_RAM">
      <description>FMC Erase Write (in RAM) example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FMC_WriteErase_lock_in_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO External Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\GPIO\GPIO_extint">
      <description>GPIO External Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_extint.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Input Output" doc="Abstract.txt" folder="A31G32x\Examples\GPIO\GPIO_inputoutput">
      <description>GPIO Input Output example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_inputoutput.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO LED Blinky" doc="Abstract.txt" folder="A31G32x\Examples\GPIO\GPIO_LedBlinky">
      <description>GPIO LED Blinky example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C MasterSlave For A31G324 To A31G324" doc="Abstract.txt" folder="A31G32x\Examples\I2C\I2C_MasterSlave_A31G324_To_A31G324">
      <description>I2C MasterSlave For A31G324 To A31G324 aexample (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2C_MasterSlave_A31G324_To_A31G324.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV I2C MasterSlave For EEPROM" doc="Abstract.txt" folder="A31G32x\Examples\I2C\I2C_MasterSlave_EEPROM">
      <description>I2C MasterSlave For EEPROM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2C_MasterSlave_EEPROM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV I2C Slave wakeup" doc="Abstract.txt" folder="A31G32x\Examples\I2C\I2C_Slave_wakeup">
      <description>I2C_Slave_wakeup example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2C_Slave_wakeup.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR LVI interrupt" doc="Abstract.txt" folder="A31G32x\Examples\PWR\LVI_interrupt">
      <description>PWR LVI interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVI_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV PWR LVI Polling" doc="Abstract.txt" folder="A31G32x\Examples\PWR\LVI_polling">
      <description>PWR LVI Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVI_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR Sleep" doc="Abstract.txt" folder="A31G32x\Examples\PWR\PWR_Sleep">
      <description>PWR Sleep example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWR_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR STANDBY" doc="Abstract.txt" folder="A31G32x\Examples\PWR\PWR_STANDBY">
      <description>PWR STANDBY example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWR_STANDBY.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR STOP" doc="Abstract.txt" folder="A31G32x\Examples\PWR\PWR_STOP">
      <description>PWR STOP example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWR_STOP.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR VBAT" doc="Abstract.txt" folder="A31G32x\Examples\PWR\PWR_VBAT">
      <description>PWR VBAT example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWR_VBAT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV RTC Alaram" doc="Abstract.txt" folder="A31G32x\Examples\RTC\RTC_Alaram">
      <description>RTC Alaram example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\RTC_Alaram.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV RTC Clock" doc="Abstract.txt" folder="A31G32x\Examples\RTC\RTC_Clock">
      <description>RTC Clock example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\RTC_Clock.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV RTC TimeStamp" doc="Abstract.txt" folder="A31G32x\Examples\RTC\RTC_TimeStamp">
      <description>RTC TimeStamp example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\RTC_TimeStamp.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV SPI Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\SPI\SPI_interrupt">
      <description>SPI Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV SPI Polling(With DMA)" doc="Abstract.txt" folder="A31G32x\Examples\SPI\SPI_polling_withDMA">
      <description>SPI Polling(With DMA) example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_polling_withDMA.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV Buzzer Shield Board" doc="Abstract.txt" folder="A31G32x\Examples\StarterKit\Buzzer_Shield_Board">
      <description>Buzzer Shield Board example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Buzzer_Shield_Board.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV EBI LCD Shield Board" doc="Abstract.txt" folder="A31G32x\Examples\StarterKit\EBI_LCD_Shield_Board">
      <description>EBI LCD Shield Board example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\EBI_LCD_Shield_Board.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV EEPROM Shield Board" doc="Abstract.txt" folder="A31G32x\Examples\StarterKit\EEPROM_Shield_Board">
      <description>EEPROM Shield Board example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\EEPROM_Shield_Board.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV GPIO LedBlinky" doc="Abstract.txt" folder="A31G32x\Examples\StarterKit\GPIO_LedBlinky">
      <description>GPIO LedBlinky example (A31G323/324)</description>
