XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G32x_Series.pdsc
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TEMP SENSOR Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\TEMP_SENSOR\Temp_Sensor_Interrupt">
      <description>TEMP SENSOR Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Temp_Sensor_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TEMP SENSOR Polling" doc="Abstract.txt" folder="A31G32x\Examples\TEMP_SENSOR\Temp_Sensor_Polling">
      <description>TEMP SENSOR Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Temp_Sensor_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Capture" doc="Abstract.txt" folder="A31G32x\Examples\TIMER1n\Timer_Capture">
      <description>TIMER1n Capture example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Match Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\TIMER1n\Timer_MatchInterrupt">
      <description>TIMER1n Match Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Match Polling" doc="Abstract.txt" folder="A31G32x\Examples\TIMER1n\Timer_MatchPolling">
      <description>TIMER1n Match Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n One Shot" doc="Abstract.txt" folder="A31G32x\Examples\TIMER1n\Timer_OneShot">
      <description>TIMER1n One Shot example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n PWM" doc="Abstract.txt" folder="A31G32x\Examples\TIMER1n\Timer_PWM">
      <description>TIMER1n PWM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Capture" doc="Abstract.txt" folder="A31G32x\Examples\TIMER2n\TIMER2n_Capture">
      <description>TIMER2n Capture example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER2n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Match Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\TIMER2n\TIMER2n_MatchInterrupt">
      <description>TIMER2n Match Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER2n_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Match Polling" doc="Abstract.txt" folder="A31G32x\Examples\TIMER2n\TIMER2n_MatchPolling">
      <description>TIMER2n Match Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER2n_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n One Shot" doc="Abstract.txt" folder="A31G32x\Examples\TIMER2n\TIMER2n_OneShot">
      <description>TIMER2n One Shot example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER2n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n PWM" doc="Abstract.txt" folder="A31G32x\Examples\TIMER2n\TIMER2n_PWM">
      <description>TIMER2n PWM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER2n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER30 BTB" doc="Abstract.txt" folder="A31G32x\Examples\TIMER30\TIMER30_BTB">
      <description>TIMER30 BTB example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER30_BTB.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TIMER30 Capture" doc="Abstract.txt" folder="A31G32x\Examples\TIMER30\TIMER30_Capture">
      <description>TIMER30 Capture example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER30_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TIMER30 Match Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\TIMER30\TIMER30_MatchInterrupt">
      <description>TIMER30 Match Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER30_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TIMER30 Match Polling" doc="Abstract.txt" folder="A31G32x\Examples\TIMER30\TIMER30_MatchPolling">
      <description>TIMER30 Match Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER30_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TIMER30 PWM" doc="Abstract.txt" folder="A31G32x\Examples\TIMER30\TIMER30_PWM">
      <description>TIMER30 example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER30_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER40 Capture" doc="Abstract.txt" folder="A31G32x\Examples\TIMER40\Timer40_Capture">
      <description>TIMER40 Capture example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer40_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER40 Match Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\TIMER40\Timer40_MatchInterrupt">
      <description>TIMER40 Match Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer40_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER40 Match Polling" doc="Abstract.txt" folder="A31G32x\Examples\TIMER40\Timer40_MatchPolling">
      <description>TIMER40 Match Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer40_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER40 One Shot" doc="Abstract.txt" folder="A31G32x\Examples\TIMER40\Timer40_Oneshot">
      <description>TIMER40 One Shot example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer40_Oneshot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV TIMER40 PWM" doc="Abstract.txt" folder="A31G32x\Examples\TIMER40\Timer40_PWM">
      <description>TIMER40 PWM example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer40_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART SPI Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\USART\SPI_Interrupt">
      <description>USART SPI Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART SPI Polling" doc="Abstract.txt" folder="A31G32x\Examples\USART\SPI_Polling">
      <description>USART SPI Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART UART DMA" doc="Abstract.txt" folder="A31G32x\Examples\USART\Uart_DMA">
      <description>USART UART DMA example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_DMA.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV USART UART Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\USART\Uart_Interrupt">
      <description>USART UART Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART UART Polling" doc="Abstract.txt" folder="A31G32x\Examples\USART\Uart_Polling">
      <description>USART UART Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV USART UART RTO" doc="Abstract.txt" folder="A31G32x\Examples\USART\Uart_RTO">
      <description>USART UART RTO example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_RTO.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART USRT Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\USART\Usrt_Interrupt">
      <description>USART USRT Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Usrt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART USRT Polling" doc="Abstract.txt" folder="A31G32x\Examples\USART\Usrt_Polling">
      <description>USART USRT Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Usrt_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USB HID Custom" doc="Abstract.txt" folder="A31G32x\Examples\USB\HID_Custom">
      <description>USB HID Custom example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\HID_Custom.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV HID Custom KeyBoard" doc="Abstract.txt" folder="A31G32x\Examples\USB\HID_Custom_KeyBoard">
      <description>USB Custom KeyBoard example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\HID_Custom_KeyBoard.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV USB MSC(Mass Storage Class)" doc="Abstract.txt" folder="A31G32x\Examples\USB\MSC">
      <description>USB MSC(Mass Storage Class) example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\MSC.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV USB CDC USART10" doc="Abstract.txt" folder="A31G32x\Examples\USB\USB_CDC_USART10">
      <description>USB CDC USART10 example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\USB_CDC_USART10.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\WDT\WDT_Interrupt">
      <description>WDT Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV WDT Polling" doc="Abstract.txt" folder="A31G32x\Examples\WDT\WDT_Polling">
      <description>WDT Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Reset" doc="Abstract.txt" folder="A31G32x\Examples\WDT\WDT_Reset">
      <description>WDT Reset example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT Interrupt" doc="Abstract.txt" folder="A31G32x\Examples\WT\WT_Interrupt">
      <description>WT Interrupt example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV WT Polling" doc="Abstract.txt" folder="A31G32x\Examples\WT\WT_Polling">
      <description>WT Polling example (A31G323/324)</description>
      <board name="StarterKit-A31G324RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>